//------------------------------------------------------------------------------
// Copyright (c) Microsoft Corporation. All rights reserved.
// Licensed under the MIT License.
//------------------------------------------------------------------------------

using System;
using System.Collections.Generic;
using System.Linq;
using System.Globalization;
using System.Runtime.InteropServices;
using System.Text;
using Microsoft.ML;
using Microsoft.ML.Data;
using Microsoft.ML.Runtime;

namespace Microsoft.MachineLearning.DotNetBridge
{
    public unsafe static partial class Bridge
    {
        /// <summary>
        /// This is provided by the native code and represents a native data source. It provides schema
        /// information and call backs for iteration.
        /// </summary>
        [StructLayout(LayoutKind.Explicit)]
        private struct DataSourceBlock
        {
#pragma warning disable 649 // never assigned
            [FieldOffset(0x00)]
            public readonly long ccol;
            [FieldOffset(0x08)]
            public readonly long crow;
            [FieldOffset(0x10)]
            public readonly long* ids;
            [FieldOffset(0x18)]
            public readonly sbyte** names;
            [FieldOffset(0x20)]
            public readonly InternalDataKind* kinds;
            [FieldOffset(0x28)]
            public readonly long* keyCards;
            [FieldOffset(0x30)]
            public readonly long* vecCards;
            [FieldOffset(0x38)]
            public readonly void** getters;

            // Call back pointers.
            [FieldOffset(0x40)]
            public readonly void* labelsGetter;
#pragma warning restore 649 // never assigned
        }

        /// <summary>
        /// This is provided by the native code and represents a native data source. It provides schema
        /// information and call backs for iteration.
        /// </summary>
        [StructLayout(LayoutKind.Explicit)]
        private struct DataViewBlock
        {
            // Number of columns.
            [FieldOffset(0x00)]
            public long ccol;

            // Number of rows, zero for unknown.
            [FieldOffset(0x08)]
            public long crow;

            // The following fields are all "arrays" with length ccol.

            // Column names as null terminated UTF8 encoded strings.
            [FieldOffset(0x10)]
            public sbyte** names;

            // Column data kinds.
            [FieldOffset(0x18)]
            public InternalDataKind* kinds;

            // For columns that have key type, these contain the cardinalities of the
            // key types. Zero means unbounded, -1 means not a key type.
            [FieldOffset(0x20)]
            public int* keyCards;
        }

        private struct ColumnMetadataInfo
        {
            public bool Expand;
            public string[] SlotNames;
            public Dictionary<uint, ReadOnlyMemory<char>> KeyNameValues;

            public ColumnMetadataInfo(bool expand, string[] slotNames, Dictionary<uint, ReadOnlyMemory<char>> keyNameValues)
            {
                Expand = expand;
                SlotNames = slotNames;
                KeyNameValues = keyNameValues;
            }
        }

        private static unsafe void SendViewToNativeAsDataFrame(IChannel ch, EnvironmentBlock* penv, IDataView view, Dictionary<string, ColumnMetadataInfo> infos = null)
        {
            Contracts.AssertValue(ch);
            Contracts.Assert(penv != null);
            Contracts.AssertValue(view);
            Contracts.AssertValueOrNull(infos);
            if (penv->dataSink == null)
            {
